Управление_торговлей.ПБТ/src/Reports/вт_ПотребностьВСырьеПоЗаказам/вт_ПотребностьВСырьеПоЗаказам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>вт_ПотребностьВСырьеПоЗаказам</name>
  <attributes>
    <name>НаДату</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаказыВПроизводство</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.вт_ЗаказВПроизводство</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сырье</name>
    <attributes>
      <name>Сырье</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Склады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Report>

Управление_торговлей.ПБТ/src/AccumulationRegisters/вт_ЗаказВПроизводство/вт_ЗаказВПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>вт_ЗаказВПроизводство</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПроизводства</name>
    <type>
      <types>DocumentRef.вт_ЗаказВПроизводство</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТребуемаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_торговлей.ПБТ/src/InformationRegisters/вт_СтатусыЗаказовВПроизводство/вт_СтатусыЗаказовВПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>вт_СтатусыЗаказовВПроизводство</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.вт_СтатусыПроизводства</types>
    </type>
  </resources>
  <dimensions>
    <name>ЗаказВПроизводство</name>
    <type>
      <types>DocumentRef.вт_ЗаказВПроизводство</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_торговлей.ПБТ/src/AccumulationRegisters/Закупки/Закупки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="99326c2e-b338-40c0-a601-ae5e673e9fb7">
  <name>Закупки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <registerType>Turnovers</registerType>
  <resources extendedConfigurationObject="b8cfb710-2e8e-4757-bb47-c6cf9a7d37e9">
    <name>Стоимость</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="e3de6fae-c863-4ba4-9975-beed3356a961">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="b7a026e1-1caa-4493-b092-9156011e46bf">
    <name>АналитикаУчетаНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_торговлей.ПБТ/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e5f80ee1-11ee-4805-9a52-c7edb03a422e">
  <name>ЦеныНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="695d5be0-2491-490f-9689-78e3615b85de">
    <name>Цена</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="9c3a50fe-c553-436b-9ff3-29e6bf5abe55">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="aa1025d7-0232-4124-8a64-816e44306389">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ba4dab77-7956-4903-8aff-17c9e06ea5fa">
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Управление_торговлей.ПБТ/src/Enums/вт_СтатусыПроизводства/вт_СтатусыПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>вт_СтатусыПроизводства</name>
  <enumValues>
    <name>Ожидание</name>
  </enumValues>
  <enumValues>
    <name>ВПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
</mdclass:Enum>

Управление_торговлей.ПБТ/src/Documents/вт_ЗаказВПроизводство/вт_ЗаказВПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>вт_ЗаказВПроизводство</name>
  <basedOn>Document.ЗаказКлиента</basedOn>
  <basedOn>Document.вт_ЗаказВПроизводство</basedOn>
  <registerRecords>AccumulationRegister.вт_ОперацииВыпускаПродукции</registerRecords>
  <registerRecords>AccumulationRegister.вт_ОперацииВыпускаСырье</registerRecords>
  <registerRecords>AccumulationRegister.вт_ПлановаяСебестоимостьВыпуска</registerRecords>
  <registerRecords>AccumulationRegister.вт_ЗаказВПроизводство</registerRecords>
  <registerRecords>InformationRegister.вт_СтатусыОснованийЗаказовВПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.СвободныеОстатки</registerRecords>
  <registerRecords>InformationRegister.вт_СтатусыЗаказовВПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.ПланПроизводства</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.вт_СтатусыПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуемаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РезервироватьМатериалы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказВПроизводство</name>
    <type>
      <types>DocumentRef.вт_ЗаказВПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантПроизводства</name>
      <type>
        <types>CatalogRef.вт_ВариантыПроизводстваПоТехКартам</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесЗаЕдиницу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдИзмВес</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>п_Ширина</name>
      <comment>Ширина в развороте</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>п_Толщина</name>
      <comment>Толщина пленки</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>п_Метраж</name>
      <comment>Метраж,км</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>п_Плотность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>п_Цвет</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>п_ФактураПленки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сырье</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>9</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>Плановая расчетная себестоимость</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантПроизводства</name>
      <type>
        <types>CatalogRef.вт_ВариантыПроизводстваПоТехКартам</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязиСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Резерв</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>9</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОперацииПроизводства</name>
    <comment>Операции производства с привязкой к конкретной продукции</comment>
    <attributes>
      <name>КлючСвязиСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасходСырьяНаОперации</name>
    <comment>Расход сырья при выполнении конкретной операции производства</comment>
    <attributes>
      <name>КлючСвязиСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиОперации</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <comment>Номенклатура сырья</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>9</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей.ПБТ/src/Reports/вт_ПотребностьВСырьеПоЗаказам/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура ПримерСП()
ТаблДок.Очистить();
Секция = ТаблДок.ПолучитьОбласть("R1C1");
ТаблДок.НачатьАвтогруппировкуКолонок();
Секция.Область("R1C1").Текст = "Параметр";
ТаблДок.Вывести(Секция,1,"Группа 1",Ложь);
Для К=1 По 10 Цикл
    Секция = ТаблДок.ПолучитьОбласть("R1C1");
    Секция.Область().Текст = "А"+К;
    Секция.Область().ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
    ТаблДок.Присоединить(Секция,2,"Группа 2",Истина);
КонецЦикла;
Секция.Область("R1C1").Текст = "Итого:";
ТаблДок.Присоединить(Секция,1,"Группа 2",Ложь);
Секция.Область("R1C1").Текст = "Значение";
ТаблДок.Вывести(Секция,1,"Группа 2",Ложь);
Цена = 10; Итог = Цена;
Для К=1 По 10 Цикл
    Секция = ТаблДок.ПолучитьОбласть("R1C1");
    Секция.Область().Текст = Цена;
    ТаблДок.Присоединить(Секция,2,"Группа 2",Истина);
    Цена = Цена + 10;
    Итог = Итог + Цена;
КонецЦикла;
Секция.Область("R1C1").Текст = Итог;
ТаблДок.Присоединить(Секция,1,"Группа 2",Ложь);
ТаблДок.ЗакончитьАвтогруппировкуКолонок();
ТаблДок.ИтогиСправа = Истина;
ТаблДок.ОтображатьСетку = Ложь;
ТаблДок.Защита = Ложь;
ТаблДок.ТолькоПросмотр = Истина;
//ТабДок.Показать("Пример использования гор. автогруппировки");


КонецПроцедуры

&НаСервере
Процедура КомандаСформироватьНаСервере()
	ФормироватьНаДату = КонецДня(Отчет.НаДату);
	//Выведем шапку
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	вт_ЗаказВПроизводствоОстатки.ЗаказПроизводства КАК ЗаказПроизводства
	                      |ИЗ
	                      |	РегистрНакопления.вт_ЗаказВПроизводство.Остатки(
	                      |			&НаДату,
	                      |			ЗаказПроизводства В (&МассивЗаказов)
	                      |					И &ЕстьОтбор = ИСТИНА
	                      |				ИЛИ &ЕстьОтбор = ЛОЖЬ) КАК вт_ЗаказВПроизводствоОстатки
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.вт_ЗаказВПроизводство.Сырье КАК вт_ЗаказВПроизводствоСырье
	                      |		ПО вт_ЗаказВПроизводствоОстатки.ЗаказПроизводства = вт_ЗаказВПроизводствоСырье.Ссылка
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вт_СтатусыЗаказовВПроизводство.СрезПоследних(&НаДату, ) КАК вт_СтатусыЗаказовВПроизводствоСрезПоследних
	                      |		ПО вт_ЗаказВПроизводствоОстатки.ЗаказПроизводства = вт_СтатусыЗаказовВПроизводствоСрезПоследних.ЗаказВПроизводство
	                      |ГДЕ
	                      |	вт_СтатусыЗаказовВПроизводствоСрезПоследних.Статус <> ЗНАЧЕНИЕ(Перечисление.вт_СтатусыПроизводства.Завершено)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	вт_ЗаказВПроизводствоОстатки.ЗаказПроизводства.Дата");
	
	
	//Выборка ссылок на документы вт_ЗаказВПроизводство из остатков по регистру вт_ЗаказВПроизводство
	// с возможностью отбора из списка
	
	
	МассивЗаказов = Отчет.ЗаказыВПроизводство.Выгрузить(,"Заказ");
	Запрос.УстановитьПараметр("МассивЗаказов",МассивЗаказов);
	Запрос.УстановитьПараметр("ЕстьОтбор",МассивЗаказов.Количество()>0);
	Запрос.УстановитьПараметр("НаДату",ФормироватьНаДату);
	
	Макет = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("Макет");
	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	ОблШапкаСырье = Макет.ПолучитьОбласть("Шапка|Сырье");
	ОблШапкаЗаказ = Макет.ПолучитьОбласть("Шапка|ПоЗаказу");
	ОблШапкаИТОГИ = Макет.ПолучитьОбласть("Шапка|ИТОГИ");	
	ОблШапкаНаличие = Макет.ПолучитьОбласть("Шапка|Наличие");	
	
	ОблСтрока = Макет.ПолучитьОбласть("Строка");
	ОблСтрокаСырье = Макет.ПолучитьОбласть("Строка|Сырье");
	ОблСтрокаЗаказ = Макет.ПолучитьОбласть("Строка|ПоЗаказу");
	ОблСтрокаИТОГИ = Макет.ПолучитьОбласть("Строка|ИТОГИ");
	ОблСтрокаНаличие = Макет.ПолучитьОбласть("Строка|Наличие");
	
	ОблИТОГО = Макет.ПолучитьОбласть("ИТОГО");
	ОблИТОГОСырье = Макет.ПолучитьОбласть("ИТОГО|Сырье");
	ОблИТОГОЗаказ = Макет.ПолучитьОбласть("ИТОГО|ПоЗаказу");
	ОблИТОГОИтоги = Макет.ПолучитьОбласть("ИТОГО|ИТОГИ");
	ОблИТОГОНаличие = Макет.ПолучитьОбласть("ИТОГО|Наличие");
	
	ТаблДок.Очистить();

	МассивЗаказовВПроизводство = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЗаказПроизводства");
	ИтогоСырье = Новый Массив;
	ТаблДок.Вывести(ОблШапкаСырье);
	Для каждого ЗаказВПроизводство Из МассивЗаказовВПроизводство Цикл
		ОблШапкаЗаказ.Параметры.ИмяЗаказа = "Заказ "+СокрЛП(ЗаказВПроизводство.Номер)+
		" от "+Формат(ЗаказВПроизводство.Дата,"ДФ=dd.MM.yyyy");
		ОблШапкаЗаказ.Параметры.РасшифровкаЗаказа = ЗаказВПроизводство;
		ТаблДок.Присоединить(ОблШапкаЗаказ);
		ИтогоСырье.Добавить(0);
	КонецЦикла;
	ТаблДок.Присоединить(ОблШапкаИТОГИ);
	ТаблДок.Присоединить(ОблШапкаНаличие);

	Запрос = Новый Запрос;
	Если Отчет.Сырье.Количество()>0 Тогда
		МассивСырье = Отчет.Сырье.Выгрузить(,"Сырье");
		Запрос.УстановитьПараметр("МассивСырье",МассивСырье);
		ТекстУсловие = "
						|ГДЕ
	                    |	вт_ЗаказВПроизводствоСырье.Номенклатура В (&МассивСырье)";
	Иначе
		ТекстУсловие = "";
	КонецЕсли;	
	
	#Область ТекстЗапроса
	Запрос.Текст = "ВЫБРАТЬ
	               |	вт_ЗаказВПроизводствоОстатки.ЗаказПроизводства КАК ЗаказПроизводства,
	               |	ЕСТЬNULL(вт_ЗаказВПроизводствоСырье.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	               |	ЕСТЬNULL(вт_ЗаказВПроизводствоСырье.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	               |	вт_ЗаказВПроизводствоСырье.Количество КАК Количество,
	               |	ЕСТЬNULL(вт_ЗаказВПроизводствоСырье.Цена, 0) КАК Цена,
	               |	ЕСТЬNULL(вт_ЗаказВПроизводствоСырье.Сумма, 0) КАК Сумма
	               |ПОМЕСТИТЬ ВТ_ЗАКАЗЫ
	               |ИЗ
	               |	РегистрНакопления.вт_ЗаказВПроизводство.Остатки(
	               |			&НаДату,
	               |			ЗаказПроизводства В (&МассивЗаказов)
	               |					И &ЕстьОтбор = ИСТИНА
	               |				ИЛИ &ЕстьОтбор = ЛОЖЬ) КАК вт_ЗаказВПроизводствоОстатки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.вт_ЗаказВПроизводство.Сырье КАК вт_ЗаказВПроизводствоСырье
	               |		ПО вт_ЗаказВПроизводствоОстатки.ЗаказПроизводства = вт_ЗаказВПроизводствоСырье.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
	               |	СвободныеОстаткиОстатки.Характеристика КАК Характеристика,
	               |	СУММА(СвободныеОстаткиОстатки.ВНаличииОстаток) КАК ВНаличии,
	               |	СУММА(СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток) КАК ВРезерве
	               |ПОМЕСТИТЬ ВТ_НАЛИЧИЕ
	               |ИЗ
	               |	РегистрНакопления.СвободныеОстатки.Остатки(
	               |			&НаДату,
	               |			(Склад В (&Склады)
	               |				ИЛИ &БезСкладов)
	               |				И (Номенклатура, Характеристика) В
	               |					(ВЫБРАТЬ
	               |						ВТ.Номенклатура,
	               |						ВТ.Характеристика
	               |					ИЗ
	               |						ВТ_ЗАКАЗЫ КАК ВТ)) КАК СвободныеОстаткиОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СвободныеОстаткиОстатки.Номенклатура,
	               |	СвободныеОстаткиОстатки.Характеристика
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Закупки.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	               |	МАКСИМУМ(Закупки.Период) КАК МаксПериод,
	               |	Закупки.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика
	               |ПОМЕСТИТЬ ВТ_МАКС_ДАТА
	               |ИЗ
	               |	РегистрНакопления.Закупки КАК Закупки
	               |ГДЕ
	               |	НАЧАЛОПЕРИОДА(Закупки.Период, ДЕНЬ) <= &НаДату
	               |	И (Закупки.АналитикаУчетаНоменклатуры.Номенклатура, Закупки.АналитикаУчетаНоменклатуры.Характеристика) В
	               |			(ВЫБРАТЬ
	               |				ВТ.Номенклатура,
	               |				ВТ.Характеристика
	               |			ИЗ
	               |				ВТ_ЗАКАЗЫ КАК ВТ)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Закупки.АналитикаУчетаНоменклатуры.Номенклатура,
	               |	Закупки.АналитикаУчетаНоменклатуры.Характеристика
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ВЫБОР
	               |			КОГДА Закупки.Количество <> 0
	               |				ТОГДА Закупки.Стоимость / Закупки.Количество
	               |			ИНАЧЕ Закупки.Стоимость
	               |		КОНЕЦ, 0) КАК Цена,
	               |	ВТ_МАКС_ДАТА.Номенклатура КАК Номенклатура,
	               |	Закупки.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика
	               |ПОМЕСТИТЬ ВТ_ЦЕНЫ_ЗАКУПКИ
	               |ИЗ
	               |	ВТ_МАКС_ДАТА КАК ВТ_МАКС_ДАТА
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Закупки КАК Закупки
	               |		ПО ВТ_МАКС_ДАТА.Номенклатура = Закупки.АналитикаУчетаНоменклатуры.Номенклатура
	               |			И ВТ_МАКС_ДАТА.Характеристика = Закупки.АналитикаУчетаНоменклатуры.Характеристика
	               |			И ВТ_МАКС_ДАТА.МаксПериод = Закупки.Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	               |	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
	               |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена
	               |ПОМЕСТИТЬ ВТ_ЦЕНЫ_ПОТИПУЦЕН
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |			&НаДату,
	               |			(Номенклатура, Характеристика) В
	               |					(ВЫБРАТЬ
	               |						ВТ.Номенклатура,
	               |						ВТ.Характеристика
	               |					ИЗ
	               |						ВТ_ЗАКАЗЫ КАК ВТ)
	               |				И ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СРЕДНЕЕ(ЕСТЬNULL(ЦЕНЫ_ПОТИПУ.Цена, ЦЕНЫ_ЗАКУПКИ.Цена)) КАК ЦЕНА,
	               |	ЕСТЬNULL(ЦЕНЫ_ПОТИПУ.Номенклатура, ЦЕНЫ_ЗАКУПКИ.Номенклатура) КАК Номенклатура,
	               |	ЕСТЬNULL(ЦЕНЫ_ПОТИПУ.Характеристика, ЦЕНЫ_ЗАКУПКИ.Характеристика) КАК Характеристика
	               |ПОМЕСТИТЬ ВТ_ЦЕНЫ
	               |ИЗ
	               |	ВТ_ЦЕНЫ_ПОТИПУЦЕН КАК ЦЕНЫ_ПОТИПУ
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ЦЕНЫ_ЗАКУПКИ КАК ЦЕНЫ_ЗАКУПКИ
	               |		ПО ЦЕНЫ_ПОТИПУ.Номенклатура = ЦЕНЫ_ЗАКУПКИ.Номенклатура
	               |			И ЦЕНЫ_ПОТИПУ.Характеристика = ЦЕНЫ_ЗАКУПКИ.Характеристика
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЕСТЬNULL(ЦЕНЫ_ПОТИПУ.Номенклатура, ЦЕНЫ_ЗАКУПКИ.Номенклатура),
	               |	ЕСТЬNULL(ЦЕНЫ_ПОТИПУ.Характеристика, ЦЕНЫ_ЗАКУПКИ.Характеристика)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ЗАКАЗЫ.ЗаказПроизводства КАК ЗаказПроизводства,
	               |	ВТ_ЗАКАЗЫ.Количество КАК Количество,
	               |	ЕСТЬNULL(ВТ_НАЛИЧИЕ.ВНаличии, 0) КАК ВНаличии,
	               |	ЕСТЬNULL(ВТ_НАЛИЧИЕ.ВРезерве, 0) КАК ВРезерве,
	               |	ВЫБОР
	               |		КОГДА ВТ_ЗАКАЗЫ.Цена <> 0
	               |			ТОГДА ВТ_ЗАКАЗЫ.Цена
	               |		ИНАЧЕ ЕСТЬNULL(ВТ_ЦЕНЫ.ЦЕНА, 0)
	               |	КОНЕЦ КАК Цена,
	               |	ВЫБОР
	               |		КОГДА ВТ_ЗАКАЗЫ.Сумма <> 0
	               |			ТОГДА ВТ_ЗАКАЗЫ.Сумма
	               |		ИНАЧЕ ЕСТЬNULL(ВТ_ЗАКАЗЫ.Количество, 0) * ЕСТЬNULL(ВТ_ЦЕНЫ.ЦЕНА, 0)
	               |	КОНЕЦ КАК Сумма,
	               |	ВТ_ЗАКАЗЫ.Номенклатура КАК Номенклатура,
	               |	ЕСТЬNULL(ВТ_ЗАКАЗЫ.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика
	               |ИЗ
	               |	ВТ_ЗАКАЗЫ КАК ВТ_ЗАКАЗЫ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НАЛИЧИЕ КАК ВТ_НАЛИЧИЕ
	               |		ПО ВТ_ЗАКАЗЫ.Характеристика = ВТ_НАЛИЧИЕ.Характеристика
	               |			И ВТ_ЗАКАЗЫ.Номенклатура = ВТ_НАЛИЧИЕ.Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦЕНЫ КАК ВТ_ЦЕНЫ
	               |		ПО ВТ_ЗАКАЗЫ.Номенклатура = ВТ_ЦЕНЫ.Номенклатура
	               |			И ВТ_ЗАКАЗЫ.Характеристика = ВТ_ЦЕНЫ.Характеристика
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВТ_ЗАКАЗЫ.ЗаказПроизводства.Дата
	               |ИТОГИ
	               |	СУММА(Количество),
	               |	СУММА(ВНаличии),
	               |	СУММА(ВРезерве),
	               |	СРЕДНЕЕ(ЕСТЬNULL(Цена, 0)) КАК Цена,
	               |	СУММА(Сумма)
	               |ПО
	               |	Номенклатура,
	               |	ЗаказПроизводства";
	#КонецОбласти 
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	вт_ЗаказВПроизводствоОстатки.ЗаказПроизводства КАК ЗаказПроизводства,
	               |	вт_ЗаказВПроизводствоТовары.КлючСтроки КАК КлючСтроки,
	               |	вт_ЗаказВПроизводствоТовары.Номенклатура КАК Номенклатура,
	               |	вт_ЗаказВПроизводствоТовары.Характеристика КАК Характеристика,
	               |	вт_ЗаказВПроизводствоТовары.Количество КАК Количество,
	               |	вт_ЗаказВПроизводствоОстатки.КоличествоОстаток КАК КоличествоОстаток,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(вт_ЗаказВПроизводствоТовары.Количество, 0) = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ вт_ЗаказВПроизводствоОстатки.КоличествоОстаток / вт_ЗаказВПроизводствоТовары.Количество
	               |	КОНЕЦ КАК Коэффициент
	               |ПОМЕСТИТЬ ВТ_Заказы1
	               |ИЗ
	               |	РегистрНакопления.вт_ЗаказВПроизводство.Остатки(
	               |			&НаДату,
	               |			ЗаказПроизводства В (&МассивЗаказов)
	               |					И &ЕстьОтбор = ИСТИНА
	               |				ИЛИ &ЕстьОтбор = ЛОЖЬ) КАК вт_ЗаказВПроизводствоОстатки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.вт_ЗаказВПроизводство.Товары КАК вт_ЗаказВПроизводствоТовары
	               |		ПО вт_ЗаказВПроизводствоОстатки.ЗаказПроизводства = вт_ЗаказВПроизводствоТовары.Ссылка
	               |			И вт_ЗаказВПроизводствоОстатки.Номенклатура = вт_ЗаказВПроизводствоТовары.Номенклатура
	               |			И вт_ЗаказВПроизводствоОстатки.Характеристика = вт_ЗаказВПроизводствоТовары.Характеристика
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(вт_ЗаказВПроизводствоСырье.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	               |	ЕСТЬNULL(вт_ЗаказВПроизводствоСырье.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВТ_Заказы1.Коэффициент < 1
	               |				ТОГДА вт_ЗаказВПроизводствоСырье.Количество * ВТ_Заказы1.Коэффициент
	               |			ИНАЧЕ вт_ЗаказВПроизводствоСырье.Количество
	               |		КОНЕЦ) КАК Количество,
	               |	СРЕДНЕЕ(ЕСТЬNULL(вт_ЗаказВПроизводствоСырье.Цена, 0)) КАК Цена,
	               |	СУММА(ЕСТЬNULL(вт_ЗаказВПроизводствоСырье.Сумма, 0)) КАК Сумма,
	               |	ВТ_Заказы1.ЗаказПроизводства КАК ЗаказПроизводства
	               |ПОМЕСТИТЬ ВТ_ЗАКАЗЫ
	               |ИЗ
	               |	Документ.вт_ЗаказВПроизводство.Сырье КАК вт_ЗаказВПроизводствоСырье
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заказы1 КАК ВТ_Заказы1
	               |		ПО (ВТ_Заказы1.КлючСтроки = вт_ЗаказВПроизводствоСырье.КлючСвязиСтроки)
	               |			И вт_ЗаказВПроизводствоСырье.Ссылка = ВТ_Заказы1.ЗаказПроизводства     "+ТекстУсловие+"
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЕСТЬNULL(вт_ЗаказВПроизводствоСырье.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)),
	               |	ЕСТЬNULL(вт_ЗаказВПроизводствоСырье.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)),
	               |	ВТ_Заказы1.ЗаказПроизводства
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
	               |	СвободныеОстаткиОстатки.Характеристика КАК Характеристика,
	               |	СУММА(СвободныеОстаткиОстатки.ВНаличииОстаток) КАК ВНаличии,
	               |	СУММА(СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток) КАК ВРезерве
	               |ПОМЕСТИТЬ ВТ_НАЛИЧИЕ
	               |ИЗ
	               |	РегистрНакопления.СвободныеОстатки.Остатки(
	               |			&НаДату,
				   |			(Склад В (&Склады)
	               |				ИЛИ &БезСкладов)
				   |			И
	               |			(Номенклатура, Характеристика) В
	               |				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |					ВТ.Номенклатура,
	               |					ВТ.Характеристика
	               |				ИЗ
	               |					ВТ_ЗАКАЗЫ КАК ВТ)) КАК СвободныеОстаткиОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СвободныеОстаткиОстатки.Номенклатура,
	               |	СвободныеОстаткиОстатки.Характеристика
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Закупки.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	               |	МАКСИМУМ(Закупки.Период) КАК МаксПериод,
	               |	Закупки.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика
	               |ПОМЕСТИТЬ ВТ_МАКС_ДАТА
	               |ИЗ
	               |	РегистрНакопления.Закупки КАК Закупки
	               |ГДЕ
	               |	НАЧАЛОПЕРИОДА(Закупки.Период, ДЕНЬ) <= &НаДату
	               |	И (Закупки.АналитикаУчетаНоменклатуры.Номенклатура, Закупки.АналитикаУчетаНоменклатуры.Характеристика) В
	               |			(ВЫБРАТЬ
	               |				ВТ.Номенклатура,
	               |				ВТ.Характеристика
	               |			ИЗ
	               |				ВТ_ЗАКАЗЫ КАК ВТ)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Закупки.АналитикаУчетаНоменклатуры.Номенклатура,
	               |	Закупки.АналитикаУчетаНоменклатуры.Характеристика
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ВЫБОР
	               |			КОГДА Закупки.Количество <> 0
	               |				ТОГДА Закупки.Стоимость / Закупки.Количество
	               |			ИНАЧЕ Закупки.Стоимость
	               |		КОНЕЦ, 0) КАК Цена,
	               |	ВТ_МАКС_ДАТА.Номенклатура КАК Номенклатура,
	               |	Закупки.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика
	               |ПОМЕСТИТЬ ВТ_ЦЕНЫ_ЗАКУПКИ
	               |ИЗ
	               |	ВТ_МАКС_ДАТА КАК ВТ_МАКС_ДАТА
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Закупки КАК Закупки
	               |		ПО ВТ_МАКС_ДАТА.Номенклатура = Закупки.АналитикаУчетаНоменклатуры.Номенклатура
	               |			И ВТ_МАКС_ДАТА.Характеристика = Закупки.АналитикаУчетаНоменклатуры.Характеристика
	               |			И ВТ_МАКС_ДАТА.МаксПериод = Закупки.Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	               |	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
	               |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена
	               |ПОМЕСТИТЬ ВТ_ЦЕНЫ_ПОТИПУЦЕН
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |			&НаДату,
	               |			(Номенклатура, Характеристика) В
	               |					(ВЫБРАТЬ
	               |						ВТ.Номенклатура,
	               |						ВТ.Характеристика
	               |					ИЗ
	               |						ВТ_ЗАКАЗЫ КАК ВТ)
	               |				И ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СРЕДНЕЕ(ЕСТЬNULL(ЦЕНЫ_ПОТИПУ.Цена, ЦЕНЫ_ЗАКУПКИ.Цена)) КАК ЦЕНА,
	               |	ЕСТЬNULL(ЦЕНЫ_ПОТИПУ.Номенклатура, ЦЕНЫ_ЗАКУПКИ.Номенклатура) КАК Номенклатура,
	               |	ЕСТЬNULL(ЦЕНЫ_ПОТИПУ.Характеристика, ЦЕНЫ_ЗАКУПКИ.Характеристика) КАК Характеристика
	               |ПОМЕСТИТЬ ВТ_ЦЕНЫ
	               |ИЗ
	               |	ВТ_ЦЕНЫ_ПОТИПУЦЕН КАК ЦЕНЫ_ПОТИПУ
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ЦЕНЫ_ЗАКУПКИ КАК ЦЕНЫ_ЗАКУПКИ
	               |		ПО ЦЕНЫ_ПОТИПУ.Номенклатура = ЦЕНЫ_ЗАКУПКИ.Номенклатура
	               |			И ЦЕНЫ_ПОТИПУ.Характеристика = ЦЕНЫ_ЗАКУПКИ.Характеристика
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЕСТЬNULL(ЦЕНЫ_ПОТИПУ.Номенклатура, ЦЕНЫ_ЗАКУПКИ.Номенклатура),
	               |	ЕСТЬNULL(ЦЕНЫ_ПОТИПУ.Характеристика, ЦЕНЫ_ЗАКУПКИ.Характеристика)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ВТ_НАЛИЧИЕ.ВНаличии, 0) КАК ВНаличии,
	               |	ЕСТЬNULL(ВТ_НАЛИЧИЕ.ВРезерве, 0) КАК ВРезерве,
	               |	ВТ_ЗАКАЗЫ.Номенклатура КАК Номенклатура,
	               |	ЕСТЬNULL(ВТ_ЗАКАЗЫ.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	               |	ВТ_ЗАКАЗЫ.ЗаказПроизводства КАК ЗаказПроизводства,
	               |	ВТ_ЗАКАЗЫ.Количество КАК Количество,
	               |	ВТ_ЗАКАЗЫ.Сумма КАК Сумма,
	               |	ВТ_ЗАКАЗЫ.Цена КАК Цена
	               |ПОМЕСТИТЬ ВТ_ЗАКАЗЫ_Наличие
	               |ИЗ
	               |	ВТ_ЗАКАЗЫ КАК ВТ_ЗАКАЗЫ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НАЛИЧИЕ КАК ВТ_НАЛИЧИЕ
	               |		ПО ВТ_ЗАКАЗЫ.Характеристика = ВТ_НАЛИЧИЕ.Характеристика
	               |			И ВТ_ЗАКАЗЫ.Номенклатура = ВТ_НАЛИЧИЕ.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ЗАКАЗЫ_Наличие.Номенклатура КАК Номенклатура,
	               |	ВТ_ЗАКАЗЫ_Наличие.Характеристика КАК Характеристика,
	               |	ВТ_ЗАКАЗЫ_Наличие.ЗаказПроизводства КАК ЗаказПроизводства,
	               |	ВТ_ЗАКАЗЫ_Наличие.ВНаличии КАК ВНаличии,
	               |	ВТ_ЗАКАЗЫ_Наличие.ВРезерве КАК ВРезерве,
	               |	ВЫБОР
	               |		КОГДА ВТ_ЗАКАЗЫ_Наличие.Цена <> 0
	               |			ТОГДА ВТ_ЗАКАЗЫ_Наличие.Цена
	               |		ИНАЧЕ ЕСТЬNULL(ВТ_ЦЕНЫ.ЦЕНА, 0)
	               |	КОНЕЦ КАК ЦЕНА,
	               |	ВТ_ЗАКАЗЫ_Наличие.Количество КАК Количество,
	               |	ВЫБОР
	               |		КОГДА ВТ_ЗАКАЗЫ_Наличие.Сумма <> 0
	               |			ТОГДА ВТ_ЗАКАЗЫ_Наличие.Сумма
	               |		ИНАЧЕ ЕСТЬNULL(ВТ_ЗАКАЗЫ_Наличие.Количество, 0) * ЕСТЬNULL(ВТ_ЦЕНЫ.ЦЕНА, 0)
	               |	КОНЕЦ КАК Сумма
	               |ИЗ
	               |	ВТ_ЗАКАЗЫ_Наличие КАК ВТ_ЗАКАЗЫ_Наличие
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦЕНЫ КАК ВТ_ЦЕНЫ
	               |		ПО ВТ_ЗАКАЗЫ_Наличие.Номенклатура = ВТ_ЦЕНЫ.Номенклатура
	               |			И ВТ_ЗАКАЗЫ_Наличие.Характеристика = ВТ_ЦЕНЫ.Характеристика
	               |ИТОГИ
	               |	МАКСИМУМ(ВНаличии),
	               |	МАКСИМУМ(ВРезерве),
	               |	СРЕДНЕЕ(ЦЕНА),
	               |	СУММА(Количество),
	               |	СУММА(Сумма)
	               |ПО
	               |	Номенклатура,
	               |	Характеристика,
	               |	ЗаказПроизводства";
	МассивЗаказов = ОТчет.ЗаказыВПроизводство.Выгрузить(,"Заказ");
	МассивСкладов = Отчет.Склады.Выгрузить(,"Склад");
	
	Запрос.УстановитьПараметр("Склады",МассивСкладов);
	Запрос.УстановитьПараметр("БезСкладов", ?(МассивСкладов.Количество()=0, ИСТИНА, ЛОЖЬ));
	Запрос.УстановитьПараметр("МассивЗаказов",МассивЗаказов);
	Запрос.УстановитьПараметр("ЕстьОтбор",МассивЗаказов.Количество()>0);
	Запрос.УстановитьПараметр("НаДату",ФормироватьНаДату);
	Запрос.УстановитьПараметр("ВидЦены",КонстантыСервер.ПолучитьЗначениеКонстанты("вт_ВидЦенПлановойСебестоимости"));		
	ИтогоКГ = 0;
	ИтогоДенег = 0;
	
	ВыборкаПоНоменклатуре = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	
	ТаблДок.НачатьАвтогруппировкуКолонок(); 
	
	Пока ВыборкаПоНоменклатуре.Следующий() Цикл		
		ВыборкаПоХарактеристике = ВыборкаПоНоменклатуре.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		    Пока ВыборкаПоХарактеристике.Следующий() ЦИКЛ
			ОблСтрокаСырье.Параметры.Сырье = СокрЛП(ВыборкаПоНоменклатуре.Номенклатура)+
			" "+ СокрЛП(ВыборкаПоХарактеристике.Характеристика);
			ТаблДок.Вывести(ОблСтрокаСырье,1,"Гр1");
			
			ИтогоКгСырье = 0;
			ИндексМассива = 0;
			ВыборкаПоЗаказам = ВыборкаПоХарактеристике.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Для каждого ЗаказВПроизводство Из МассивЗаказовВПроизводство Цикл
				ВыборкаПоЗаказам.Сбросить();			
				Пока ВыборкаПоЗаказам.Следующий() Цикл				
					Если ВыборкаПоЗаказам.ЗаказПроизводства = ЗаказВПроизводство Тогда
						ОблСтрокаЗаказ.Параметры.ПотребностьСырье = ВыборкаПоЗаказам.Количество;
						ИтогоКгСырье = ИтогоКгСырье + ВыборкаПоЗаказам.Количество;
						ИтогоСырье[ИндексМассива] = ИтогоСырье[ИндексМассива] + ВыборкаПоЗаказам.Количество;
						Прервать;
					Иначе 
						ОблСтрокаЗаказ.Параметры.ПотребностьСырье = 0;
					КонецЕсли;			
				КонецЦикла;
				ТаблДок.Присоединить(ОблСтрокаЗаказ,2,"Заказы");
				ИндексМассива = ИндексМассива + 1;
			КонецЦикла; 
			ОблСтрокаИТОГИ.Параметры.ИтогоКгСырье = ИтогоКгСырье;
			ОблСтрокаИТОГИ.Параметры.ЦенаЗаКгСырье = ВыборкаПоНоменклатуре.Цена;
			ОблСтрокаИТОГИ.Параметры.ИтогоДенегСырье = ВыборкаПоНоменклатуре.Сумма;
			ТаблДок.Присоединить(ОблСтрокаИТОГИ,1,"Заказы");
			
			ОблСтрокаНаличие.Параметры.НаличиеСырье 	= ВыборкаПоНоменклатуре.ВНаличии;
			ОблСтрокаНаличие.Параметры.ДефицитПрофицит  = ВыборкаПоНоменклатуре.ВНаличии - ИтогоКгСырье;
			ОблСтрокаНаличие.Параметры.РезервСырье		= ВыборкаПоНоменклатуре.ВРезерве;
			ОблСтрокаНаличие.Параметры.ДоступныйОстаток = ИтогоКгСырье - ВыборкаПоНоменклатуре.ВНаличии - ВыборкаПоНоменклатуре.ВРезерве;
			ТаблДок.Присоединить(ОблСтрокаНаличие,1,"Гр1");
			
			ИтогоКГ = ИтогоКГ + ИтогоКгСырье;
			ИтогоДенег = ИтогоДенег + ВыборкаПоНоменклатуре.Сумма;
		КонецЦикла;	
	КонецЦикла;
	
	ТаблДок.Вывести(ОблИТОГОСырье,1,"Гр1");
	ИндексМассива = 0;
	Для каждого ЗаказВПроизводство Из МассивЗаказовВПроизводство Цикл
		ОблИТОГОЗаказ.Параметры.ИтогоСырье = ИтогоСырье[ИндексМассива];
	    ТаблДок.Присоединить(ОблИТОГОЗаказ,2,"Заказы");
		ИндексМассива = ИндексМассива + 1;
	КонецЦикла;	
	ОблИТОГОИтоги.Параметры.ИтогоКГ = ИтогоКГ;
	ОблИТОГОИтоги.Параметры.ИтогоДенег = ИтогоДенег;
	ТаблДок.Присоединить(ОблИТОГОИтоги,1,"Гр1");

	ТаблДок.Присоединить(ОблИТОГОНаличие,1,"Гр1");
	//++
	ТаблДок.ЗакончитьАвтогруппировкуКолонок(); 
	//--
	ТаблДок.ФиксацияСверху = 1;	
	ТаблДок.ФиксацияСлева = 1;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформировать(Команда)
	КомандаСформироватьНаСервере();
	//ПримерСП();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отчет.НаДату = ТекущаяДата();
КонецПроцедуры
